---
type: AppearanceAssetElement
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# AppearanceAssetElement

`Autodesk.Revit.DB.AppearanceAssetElement` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2014 | `public static AppearanceAssetElement Create ( Document document , string name , Asset asset )` |
| Method | Duplicate | 2018.1 | `public AppearanceAssetElement Duplicate ( string name )` |
| Method | GetAppearanceAssetElementByName | 2014 | `public static AppearanceAssetElement GetAppearanceAssetElementByName ( Document doc , string name )` |
| Method | GetRenderingAsset | 2014 | `public Asset GetRenderingAsset ()` |
| Method | SetRenderingAsset | 2014 | `public void SetRenderingAsset ( Asset asset )` |
| Property | Parameter | — | `` |